import Contacts from "@/components/sections/Contacts";
import Hero from "@/components/sections/Hero";
import FAQ from "@/components/sections/FAQ";

export const metadata = {
  title: "Контакты | Спа-салон ЭДЕМ в Кемерово | Запись на процедуры",
  description:
    "📍 Контакты спа-салона ЭДЕМ в Кемерово. Удобное расположение, комфортная парковка, уютная атмосфера. Запишитесь на спа-процедуры, массаж или консультацию косметолога.",
  keywords:
    "контакты спа салона Кемерово, адрес спа центра, запись на спа процедуры, телефон спа салона, как добраться до спа салона, график работы спа салона, расположение спа центра ЭДЕМ",
  alternates: {
    canonical: `https://spa42.ru/contacts`,
  },
  openGraph: {
    title: `Контакты | Спа-салон ЭДЕМ в Кемерово`,
    description: `Удобное расположение и комфортная парковка. Запишитесь на спа-процедуры, массаж или консультацию косметолога`,
    url: `https://spa42.ru/contacts`,
    type: "website",
    images: [
      {
        url: `/hero/about.jpg`,
        width: 1200,
        height: 630,
        alt: `Контакты спа-салона ЭДЕМ в Кемерово - уютный спа-центр для вашего отдыха`,
      },
    ],
  },
  robots: {
    index: true,
    follow: true,
  },
};

export default function ContactsPage() {
  return (
    <>
      <Hero title="Контакты спа-салона ЭДЕМ" fon="/hero/contacts.webp" />
      <FAQ />
      <Contacts />
    </>
  );
}
