import Programs from "@/components/sections/Programs";
import Contacts from "@/components/sections/Contacts";
import Hero from "@/components/sections/Hero";
import FAQ from "@/components/sections/FAQ";

export const metadata = {
  title: "Спа программы в Кемерово | Салон ЭДЕМ | Уход за телом и релакс",
  description:
    "🌸 Эксклюзивные спа-программы для женщин в Кемерово. Ритуалы красоты, массажные программы, уход за телом и релаксация. Индивидуальный подход и профессиональный уход для вашей гармонии.",
  keywords:
    "спа программы Кемерово, ритуалы красоты, массажные программы, уход за телом, релаксационные процедуры, спа ритуалы, программы релакса, уход за кожей, антистресс программы",
  alternates: {
    canonical: `https://spa42.ru/programs`,
  },
  openGraph: {
    title: `Спа программы в Кемерово | Салон ЭДЕМ | Уход за телом и релакс`,
    description: `Эксклюзивные спа-программы для женщин. Ритуалы красоты, массажные программы и релаксация в Кемерово`,
    url: `https://spa42.ru/programs`,
    type: "website",
    images: [
      {
        url: `/hero/about.jpg`,
        width: 1200,
        height: 630,
        alt: `Спа программы и ритуалы красоты в салоне ЭДЕМ Кемерово`,
      },
    ],
  },
  robots: {
    index: true,
    follow: true,
  },
};

export default function ProgramsPage() {
  return (
    <>
      <Hero title="Спа-программы и ритуалы красоты" fon="/hero/heromas2.webp" />
      <Programs />
      <FAQ />
      <Contacts />
    </>
  );
}
