import Masters from "@/components/sections/Masters";
import Contacts from "@/components/sections/Contacts";
import Hero from "@/components/sections/Hero";
import FAQ from "@/components/sections/FAQ";

export const metadata = {
  title:
    "Наши специалисты | Профессиональные массажисты в Кемерово | Салон ЭДЕМ",
  description:
    "👩‍⚕️ Профессиональные массажисты и косметологи в Кемерово. Опытные специалисты с медицинским образованием. Индивидуальный подход к каждой клиентке и забота о вашем благополучии.",
  keywords:
    "массажисты Кемерово, косметологи спа салона, специалисты по уходу за телом, профессиональные массажисты, медицинский массаж, спа специалисты, сертифицированные косметологи, мастера красоты",
  alternates: {
    canonical: `https://spa42.ru/masters`,
  },
  openGraph: {
    title: `Наши специалисты | Профессиональные массажисты и косметологи | Салон ЭДЕМ`,
    description: `Опытные специалисты с медицинским образованием. Индивидуальный подход и забота о вашем благополучии в Кемерово`,
    url: `https://spa42.ru/masters`,
    type: "website",
    images: [
      {
        url: `/hero/about.jpg`,
        width: 1200,
        height: 630,
        alt: `Профессиональные массажисты и косметологи спа-салона ЭДЕМ в Кемерово`,
      },
    ],
  },
  robots: {
    index: true,
    follow: true,
  },
};

export default function MastersPage() {
  return (
    <>
      <Hero title="Наши специалисты" fon="/hero/heromas.jpg" />
      <Masters />
      <FAQ />
      <Contacts />
    </>
  );
}
